<?php
/*
// 1: دراسه كيفيه سير العمل
2: كتابه كافه النماذج والعمليات الي يتكون منها التطبيق
3: شرح كامل لكل عمليه او صلاحيه
4: توضيح كل نموذج علي حده

====================
1: المستخدمين 
   الموظفبن في الشركخ
        1-1  الاداره العامه ليها كافه الصلاحيات
            التقارير (    عرض المخزن والكميات الموجوده بيه
            /المديونيات/  الديون)
            -اقسام المنتجات
            - االمخزن )اقسم المنتجات-المنتج()
            التحكم ف المستخدمين
            الموردين والتحكم فيهم
            العملاء
            المصروفات
            المعاملات
        1-2 المحاسب
            يدخل فقط علي العملاء
            علي الموردين 
            لكن هشيل منه صلاحيه الحذف
            بعض التقارير
             البيع فقط المعاملات
           اضافه وتعديل فقط  العملاء
           المصروفات فقط ولكن لا يطلع علي البنود الاساسيه
        1-3
        امين مخزن
            المخزن التحمن بالاصناف اضافه وتعديل فقط
            المشتريات انشاء فاتوره فقط 

    2: 
    المخزن ينقسم الي قسمين
    اولا الاصناف
    وثانيا المنتحات

    3: العملاء
    4: الموردين
    5: المصروفات
    انواع المصروفات
    -مصروفات يوميه
    - مصروفات شهريه

    5: التقارير

    ===========
    6: المعاملات الي هي الفواتير الحقيقيه
    شراء وبيع
    -المشتؤيات
        الفواتير
        
    -المبيعات
        فواتير مبيعات
    7: التنبيهات

